{
  "hello": "hello world",
  "title": "Noah",
  "description": "Noah's profile",

  "header": {
    "name": "Noah",
    "nabs": {
      "about": "About",
      "experience": "Experience",
      "portfolio": "Projects",
      "contact": "Contact"
    }
  },
  "top": {
    "introduction-1": "Frontend Developer with approximately {{experienceYears}} years of experience specializing in TypeScript, React, and Next.js.",
    "introduction-2": "I am also working on streamlining and accelerating UI development by leveraging MCP servers to enhance our design system and integrate with AI tools.",
    "resume": "resume"
  },
  "about": {
    "information": {
      "skillsLabel": "Skills",
      "languagesLabel": "Programming Language",
      "frameworksLabel": "Framework / Library",
      "othersLabel": "Other",
      "certificationsLabel": "Certification"
    }
  },
  "portfolio": {
    "viewAllProjects": "View all projects",
    "items": [
      {
        "subTitle": "Google extension",
        "title": "Anki Quicker",
        "description": "Anki Quicker is a Google Chrome extension that allows you to quickly add cards to Anki.",
        "image": "AnkiQuikcer",
        "technologies": "TypeScript,React,Next.js,Tailwind,Anki-Connect-API",
        "github": "https://github.com/noah-00/anki-quicker",
        "demo": "https://chromewebstore.google.com/detail/anki-quicker/bkffcipebmidpcbhipmblnpmoaofdinh?hl=en",
        "type": "Web Services"
      }
    ]
  },
  "experience": {
    "viewResume": "Download the full resume",
    "items": {
      "STUDYPOCKET": {
        "year": "2025/01 ~",
        "title": "StudyPocket Inc.",
        "description": "Working as a full-stack engineer, responsible for the development of in-house products.",
        "projectsCount": "1",
        "projects": [
          {
            "title": "Generative AI Service Development for Educational Institutions",
            "year": "2025/01 ~",
            "description": "Mainly responsible for front-end development of a generative AI service for educational institutions. Worked on rebuilding the application, implementing a new admin dashboard, and optimizing API integration.",
            "techStackKeys": "TS,REACT,NEXT,TAIL,JOTAI,PYTHON,FASTAPI"
          }
        ]
      },
      "SIGNITE": {
        "year": "2024/02 ~ 2024/12",
        "title": "Signite Inc.",
        "description": "Worked as a frontend engineer, responsible for developing client applications.",
        "projectsCount": "1",
        "projects": [
          {
            "title": "Travel & Tourism SNS Development",
            "year": "2024/02 ~ 2024/12",
            "description": "Handled frontend development for a travel and tourism industry SNS app, focusing on implementing additional features and optimizing for SEO.",
            "techStackKeys": "TS,REACT,NEXT,RECOIL,TAIL"
          }
        ]
      },
      "TDC": {
        "year": "2023/09 ~ 2024/09",
        "title": "TDC Software Inc.",
        "description": "As a Full Stack Engineer, I was involved in both in-house and client-based application development.",
        "projectsCount": "3",
        "projects": [
          {
            "title": "Development of Account Management App for Elementary and Junior High Schools",
            "year": "2024/03 ~ 2024/09",
            "description": "Responsible for frontend development of an account management app for elementary and junior high schools. The app addresses issues such as students forgetting passwords and the labor-intensive process of issuing accounts for new students, caused by individual accounts for multiple apps provided by the company.",
            "techStackKeys": "TS,REACT,NEXT,RECOIL,MUI,VITEST,STORYBOOK,NODE,AWS"
          },
          {
            "title": "New Development of Abnormal Equipment Detection App",
            "year": "2023/09 ~ 2024/02",
            "description": "Participated in the new development of an app that detects abnormalities in manufacturing systems within factories. Primarily responsible for frontend development and infrastructure setup. The app uses machine learning to analyze data such as equipment vibrations, detects abnormalities, and delivers notifications and dashboards to users.",
            "techStackKeys": "TS,VUE,NUXT,PINIA,VUETIFY,PYTHON,FASTAPI,AWS"
          },
          {
            "title": "Development of Internal Jira Extension App",
            "year": "2023/09 ~ 2023/11",
            "description": "Developed an internal app to enhance Jira's functionality, aimed at improving operational efficiency. Implemented features to reduce repetitive tasks, such as bulk backlog creation and template functionalities.",
            "techStackKeys": "TS,REACT,TAIL"
          }
        ]
      },
      "WINOO": {
        "year": "2020/06 ~ 2022/08",
        "title": "Winoo Inc.",
        "description": "As a Full Stack Engineer, I worked on application development for various clients.",
        "projectsCount": "1",
        "projects": [
          {
            "title": "Public DMP (Data Management Platform) Visualization Tool - New Development / Maintenance",
            "year": "2020/06 ~ 2022/08",
            "description": "Developed and maintained a data management platform that helps businesses effectively utilize their customer data to acquire new customers and enhance the loyalty of existing ones through various graphical tools. As a full-stack engineer, I was involved in frontend, backend, and infrastructure development.",
            "techStackKeys": "TS,VUE,VUEX,VUETIFY,NODE,AWS"
          }
        ]
      }
    }
  },
  "contact": {
    "title": "Get In Touch",
    "content": "I’m  currently looking for new opportunities.",
    "content-2": "If you have a question or just want to say hi, don't hesitate to email me. I’ll try my best to get back to you!",
    "button": "Mail"
  }
}
